#include<allfunc.h>
void chat_robot(int *page);
void  chat_study(int *page);
void  chat_movie(int *page);
void  chat_scenic(int *page);

void chat_robot(int *page)
{
    mouse_off(&mouse);
    bar1(0,0,1024,768, 0x5686BF);
    bar1(35, 32, 989, 744, 0xFFFFFF);
   
    ThickDiagonalLine(35,32,989,32,2,0x003399);
    ThickDiagonalLine(35,32,35,744,2,0x003399);
    ThickDiagonalLine(35,744,989,744,2,0x003399);
    ThickDiagonalLine(989,32,989,744,2,0x003399); 
    Readbmp64k(372,310, "bmp\\tian.bmp");
    bar1(564,363,679,399, 0xF0F8FF);
    puthz(570,370,"景点推荐", 24, 24, 0x000000);
    Readbmp64k(77,89, "bmp\\xue.bmp");
    bar1(286,155,350,192, 0xF0F8FF);
    puthz(290,160,"学习", 24, 24, 0x000000);
    Readbmp64k(653,507, "bmp\\dian.bmp");
    bar1(814,549,932,597, 0xF0F8FF);
    puthz(824,560,"最新电影", 24, 24, 0x000000);
    puthz(99,60,"今天想聊点什么？", 24, 24, 0x000000);
    puthz(400,90,"我可以为你推荐一些景点哦！", 24, 24, 0x000000);
    puthz(400,120,"我还可以为你推荐一些电影哦！", 24, 24, 0x000000);
    puthz(400,150,"我还可以为你推荐一些学习方法哦！", 24, 24, 0x000000);
    puthz(70,607,"生活不止眼前的苟且，还有诗和远方！", 24, 24, 0x000000);
    put_asc16_size(70,637,1,1,"Life is not just about survival, but poetry and distance.", 0x000000);
    bar2(61,599,528,655,0x00BFFF);
    ThickDiagonalLine(61,599,528,599,2,0x00BFFF);
    ThickDiagonalLine(61,599,61,655,2,0x00BFFF);
    ThickDiagonalLine(61,655,528,655,2,0x00BFFF); 
    ThickDiagonalLine(528,599,528,655,2,0x00BFFF);
    Readbmp64k(119,300, "bmp\\liao.bmp");
    bar1(872,704,970,730, 0x003399);
    puthz(892,708,"退出", 24, 24, 0x000000);
    mouse_on(mouse);
    while(1)
    {
        mouse_show(&mouse);
        if (mouse_press(564,363,679,399) == 2)//景点功能
		{
			bar2(564,363,679,399, 0x00477D);
		}
		else if (mouse_press(564,363,679,399) != 2)
		{
			bar2(564,363,679,399, 0xFFFFFF);
		}
        if (mouse_press(286,155,350,192) == 2)//学习功能
        {            bar2(286,155,350,192, 0x00477D);
        }
        else if (mouse_press(286,155,350,192) != 2)
        {
            bar2(286,155,350,192, 0xFFFFFF);
        }
        if (mouse_press(814,549,932,597) == 2)//最新电影
        {
            bar2(814,549,932,597, 0x00477D);
        }
        else if (mouse_press(814,549,932,597) != 2)
        {
            bar2(814,549,932,597, 0xFFFFFF);
        }
        if (mouse_press(872,704,970,730) == 2)//退出
        {
            bar2(872,704,970,730, 0x00477D);
        }
        else if (mouse_press(872,704,970,730) != 2)
        {
            bar2(872,704,970,730, 0x003399);
        }

        if (mouse_press(564,363,679,399) ==1)//景点功能
        {
            chat_scenic(page);
            break;
        }
        else if (mouse_press(286,155,350,192) ==1)//学习功能
        {
            chat_study(page);
            break;
        }
        else if (mouse_press(814,549,932,597) ==1)//最新电影
        {
            chat_movie(page);
            break;
        }
        else if (mouse_press(872,704,970,730) ==1)//退出
        {

            *page=4;
            break;
        }

        
    }


}



void  chat_study(int *page)
{
    mouse_off(&mouse);
    bar1(857, 19, 1004, 67, 0x5686BF);
    bar1(35, 32, 989, 744, 0xFFFFFF);
    ThickDiagonalLine(35,32,989,32,2,0x003399);
    ThickDiagonalLine(35,32,35,744,2,0x003399);
    ThickDiagonalLine(35,744,989,744,2,0x003399);
    ThickDiagonalLine(989,32,989,744,2,0x003399); 
    bar1(45,20,165,60,0x003399);
    puthz(50,25,"学习话题", 24, 24, 0xFFFFFF);
    ThickDiagonalLine(987,11,1016,43,2,0xE6E6FA);
    ThickDiagonalLine(987,43,1016,11,2,0xE6E6FA);

    bar1(72,82,517,113,0xE6E6FA);
    puthz(80,85,"如何克服拖延症，快速进入学习状态？", 24, 24, 0x000000);
    bar1(72,202,320,233,0xE6E6FA);
    puthz(80,205,"如何提高学习效率？", 24, 24, 0x000000);
    bar1(72,324,340,355,0xE6E6FA);
    puthz(80,327,"如何保持学习的动力？", 24, 24, 0x000000);
    bar1(72,447,360,478,0xE6E6FA);
    puthz(80,450,"如何克服学习中的困难？", 24, 24, 0x000000);
    bar1(72,570,340,601,0xE6E6FA);
    puthz(80,573,"如何提高学习的乐趣？", 24, 24, 0x000000);
    mouse_on(mouse);
    while(1)
    {   
        mouse_show(&mouse);
        if (mouse_press(987,11,1016,43) == 2)//退出
        {
            bar2(987,11,1016,43, 0x00477D);
        }
        else if (mouse_press(987,11,1016,43) != 2)
        {
            bar2(987,11,1016,43, 0x003399);
        }
        if (mouse_press(72,82,517,113) == 2)//如何克服拖延症，快速进入学习状态？
        {
            bar2(72,82,517,113, 0x00477D);
        }
        else if (mouse_press(72,82,517,113) != 2)
        {
            bar2(72,82,517,113, 0xE6E6FA);
        }
        if (mouse_press(72,202,320,233) == 2)//如何提高学习效率？
        {
            bar2(72,202,320,233, 0x00477D);
        }
        else if (mouse_press(72,202,320,233) != 2)
        {
            bar2(72,202,320,233, 0xE6E6FA);
        }
        if (mouse_press(72,324,340,355) == 2)//如何保持学习的动力？
        {
            bar2(72,324,340,355, 0x00477D);
        }
        else if (mouse_press(72,324,340,355) != 2)
        {
            bar2(72,324,340,355, 0xE6E6FA);
        }
        if (mouse_press(72,447,360,478) == 2)//如何克服学习中的困难？
        {
            bar2(72,447,360,478, 0x00477D);
        }
        else if (mouse_press(72,447,360,478) != 2)
        {
            bar2(72,447,360,478, 0xE6E6FA);
        }
        if (mouse_press(72,570,340,601) == 2)//如何提高学习的乐趣？
        {
            bar2(72,570,340,601, 0x00477D);
        }
        else if (mouse_press(72,570,340,601) != 2)
        {
            bar2(72,570,340,601, 0xE6E6FA);
        }
        if (mouse_press(987,11,1016,43) == 1)//退出
        {
            *page=15;
            break;
        }
        else if (mouse_press(72,82,517,113) == 1)
        {
            bar1(72,114,380,200, 0xffffff);
            puthz(72,115,"制定明确的学习计划和目标", 24, 24, 0x000000);
            puthz(72,142,"分解任务，设定小目标", 24, 24, 0x000000);  
            puthz(72,172,"使用番茄工作法，集中注意力", 24, 24, 0x000000);
        }
        else if (mouse_press(72,202,320,233) == 1)
        {
            bar1(72,234,380,324, 0xffffff);
            puthz(72,236,"选择适合自己的学习方法", 24, 24, 0x000000);
            puthz(72,264,"创造良好的学习环境", 24, 24, 0x000000);
            puthz(72,294,"定期复习，巩固知识", 24, 24, 0x000000);
        }
        else if (mouse_press(72,324,340,355) == 1)
        {
            bar1(72,356,380,445, 0xffffff);
            puthz(72,358,"找到自己的学习兴趣", 24, 24, 0x000000);
            puthz(72,387,"与他人分享学习成果", 24, 24, 0x000000);
            puthz(72,417,"设定奖励机制", 24, 24, 0x000000);
        }
        else if (mouse_press(72,447,360,478) == 1)
        {
            bar1(72,479,380,570, 0xffffff);
            puthz(72,481,"寻求他人的帮助", 24, 24, 0x000000);
            puthz(72,510,"保持积极的心态", 24, 24, 0x000000);
            puthz(72,540,"坚持不懈，勇往直前", 24, 24, 0x000000);
        }
        else if (mouse_press(72,570,340,601) == 1)
        {
            bar1(72,602,380,700, 0xffffff);
            puthz(72,605,"选择有趣的学习内容", 24, 24, 0x000000);
            puthz(72,633,"参与学习小组", 24, 24, 0x000000);
            puthz(72,663,"结合实践，增加互动", 24, 24, 0x000000);
        }
    }
}

void chat_movie(int *page)
{
    mouse_off(&mouse);
    bar1(857, 19, 1004, 67, 0x5686BF);
    bar1(35, 32, 989, 744, 0xCCCC4D);
    ThickDiagonalLine(30,32,989,32,2,0x003399);
    ThickDiagonalLine(30,32,30,744,2,0x003399);
    ThickDiagonalLine(30,744,989,744,2,0x003399);
    ThickDiagonalLine(989,32,989,744,2,0x003399); 
    bar1(45,20,165,60,0x003399);
    puthz(50,25,"电影话题", 24, 24, 0xFFFFFF);
    bar1(45,60,190,90,0x008B8B);
    puthz(50,65,"最新电影推荐",24,24,0xffffff);
    bar1(45,90,230,135,0x7CFC00);
    ThickDiagonalLine(43,60,970,60,2,0xF0FFF0);
    ThickDiagonalLine(43,60,43,734,2,0xF0FFF0);
    ThickDiagonalLine(43,734,970,734,2,0xF0FFF0);
    ThickDiagonalLine(970,60,970,734,2,0xF0FFF0);
    puthz(40,95,"《流浪地球》",32,32,0xffffff);
    bar1(45,230,230,275,0x7CFC00);
    puthz(50,230,"《长津湖》",32,32,0xffffff);
    bar1(45,375,230,420,0x7CFC00);
    puthz(50,375,"《战狼》",32,32,0xffffff);
    bar1(45,530,230,575,0x7CFC00);
    puthz(50,530,"《红海行动》",32,32,0xffffff);
    ThickDiagonalLine(987,11,1016,43,2,0xE6E6FA);
    ThickDiagonalLine(987,43,1016,11,2,0xE6E6FA);
    bar1(240,90,960,700,0xFFFFFF);
    mouse_on(mouse);
    while(1)
    {
        mouse_show(&mouse);
        if (mouse_press(45,90,230,135) == 2)//流浪地球
        {
            bar2(45,90,230,135, 0x00477D);
        }
        else if (mouse_press(45,90,230,135) != 2)
        {
            bar2(45,90,230,135, 0x003399);
        }
        if (mouse_press(45,230,230,275) == 2)//长津湖
        {
            bar2(45,230,230,275, 0x00477D);
        }
        else if (mouse_press(45,230,230,275) != 2)
        {
            bar2(45,230,230,275, 0x003399);
        }
        if (mouse_press(45,375,230,420) == 2)//战狼
        {
            bar2(45,375,230,420, 0x00477D);
        }
        else if (mouse_press(45,375,230,420) != 2)
        {
            bar2(45,375,230,420, 0x003399);
        }
        if (mouse_press(45,530,230,575) == 2)//红海行动
        {
            bar2(45,530,230,575, 0x00477D);
        }
        else if (mouse_press(45,530,230,575) != 2)
        {
            bar2(45,530,230,575, 0x003399);
        }
        if (mouse_press(987,11,1016,43) == 2)//退出
        {
            bar2(985,9,1018,45, 0x000000);
        }
        else if (mouse_press(987,11,1016,43) != 2)
        {
            bar2(985,9,1018,45, 0x003399);
        }
        if(mouse_press(45,90,230,135) == 1)//流浪地球
        {
            bar1(240,90,960,700,0xFFFFFF);
            Readbmp64k(252,120, "bmp\\liu.bmp");
            puthz(510,120,"《流浪地球》电影简介", 24, 24, 0x000000);
            puthz(510,150,"导演：郭帆", 24, 24, 0x000000);
            puthz(510,180,"主演：屈楚萧、李光洁、吴京", 24, 24, 0x000000);
            puthz(510,210,"类型：科幻、动作", 24, 24, 0x000000);
            puthz(510,240,"简介：在未来的某一天，太阳即将毁灭，", 24, 24, 0x000000);
            puthz(510,270,"人类为了生存，决定将地球推向新的星系。", 24, 24, 0x000000);
            puthz(510,300,"在这个过程中，地球经历了无数的磨难，", 24, 24, 0x000000);
            puthz(510,330,"人类也在不断地探索和奋斗。", 24, 24, 0x000000);
            puthz(510,360,"这部电影展现了人类的勇气和智慧，", 24, 24, 0x000000);
            puthz(510,390,"让我们看到了希望和未来。", 24, 24, 0x000000);
            puthz(510,420,"这是一部充满感动和思考的电影，", 24, 24, 0x000000);  
            puthz(510,450,"值得每一个人去观看。", 24, 24, 0x000000);

        }
        else if(mouse_press(45,230,230,275) == 1)//长津湖
        {
            bar1(240,90,960,700,0xFFFFFF);
            Readbmp64k(252,120, "bmp\\chang.bmp");
            puthz(510,120,"《长津湖》电影简介", 24, 24, 0x000000);
            puthz(510,150,"导演：陈凯歌、徐克、林超贤", 24, 24, 0x000000); 
            puthz(510,180,"主演：吴京、易烊千玺、段奕宏", 24, 24, 0x000000);
            puthz(510,210,"类型：战争、历史", 24, 24, 0x000000);
            puthz(510,240,"简介：电影讲述了在抗美援朝战争中，", 24, 24, 0x000000);
            puthz(510,270,"中国人民志愿军在长津湖地区与美军展开", 24, 24, 0x000000);
            puthz(510,300,"激烈战斗的故事。", 24, 24, 0x000000);
            puthz(510,330,"影片通过真实的历史事件，", 24, 24, 0x000000);
            puthz(510,360,"展现了中国人民志愿军的英勇和无畏，", 24, 24, 0x000000);
            puthz(510,390,"让我们看到了战争的残酷和人性的光辉。", 24, 24, 0x000000);
            puthz(510,420,"这是一部充满热血和奉献的电影，", 24, 24, 0x000000);
            puthz(510,450,"值得每一个人去观看。", 24, 24, 0x000000);
        }
        else if(mouse_press(45,375,230,420) == 1)//战狼
        {
            bar1(240,90,960,700,0xFFFFFF);
            Readbmp64k(252,120, "bmp\\zhan.bmp");
            puthz(510,120,"《战狼》电影简介", 24, 24, 0x000000);
            puthz(510,150,"导演：吴京", 24, 24, 0x000000);
            puthz(510,180,"主演：吴京、冷锋、卢靖姗", 24, 24, 0x000000);
            puthz(510,210,"类型：动作、战争", 24, 24, 0x000000);
            puthz(510,240,"简介：电影讲述了中国特种兵冷锋", 24, 24, 0x000000);
            puthz(510,270,"在执行任务中，遭遇恐怖分子袭击，", 24, 24, 0x000000);
            puthz(510,300,"为了保护同胞和国家利益，", 24, 24, 0x000000);
            puthz(510,330,"展开了一场惊心动魄的战斗。", 24, 24, 0x000000);
            puthz(510,360,"影片通过真实的事件，", 24, 24, 0x000000);
            puthz(510,390,"展现了中国军人的英勇和无畏，", 24, 24, 0x000000);
            puthz(510,420,"让我们看到了国家的力量和希望。", 24, 24, 0x000000);
            puthz(510,450,"这是一部充满热血和感动的电影，", 24, 24, 0x000000);
            puthz(510,480,"值得每一个人去观看。", 24, 24, 0x000000);
        }
        else if(mouse_press(45,530,230,575) == 1)//红海行动
        {
            bar1(240,90,960,700,0xFFFFFF);
            Readbmp64k(252,120, "bmp\\hong.bmp");
            puthz(510,120,"《红海行动》电影简介", 24, 24, 0x000000);
            puthz(510,150,"导演：林超贤", 24, 24, 0x000000);
            puthz(510,180,"主演：张译、黄景瑜、海清", 24, 24, 0x000000);
            puthz(510,210,"类型：动作、战争", 24, 24, 0x000000);
            puthz(510,240,"简介：电影讲述了中国海军特战队", 24, 24, 0x000000);
            puthz(510,270,"在海外执行任务时，遭遇恐怖袭击，", 24, 24, 0x000000);
            puthz(510,300,"为了保护同胞和国家利益，", 24, 24, 0x000000);
            puthz(510,330,"展开了一场惊心动魄的战斗。", 24, 24, 0x000000);
            puthz(510,360,"影片通过真实的事件，", 24, 24, 0x000000);
            puthz(510,390,"展现了中国军人的英勇和无畏，", 24, 24, 0x000000);
            puthz(510,420,"让我们看到了国家的力量和希望。", 24, 24, 0x000000);
            puthz(510,450,"这是一部充满热血和感动的电影，", 24, 24, 0x000000);
            puthz(510,480,"值得每一个人去观看。", 24, 24, 0x000000);
        }
        else if(mouse_press(987,11,1016,43) == 1)//退出
        {
            *page=15;
            break;
            
        }
    }
}

void chat_scenic(int *page)
{
    mouse_off(&mouse);
    bar1(857, 19, 1004, 67, 0x5686BF);
    bar1(35, 32, 989, 744, 0xCCCC4D);
    ThickDiagonalLine(30,32,989,32,2,0x003399);
    ThickDiagonalLine(30,32,30,744,2,0x003399);
    ThickDiagonalLine(30,744,989,744,2,0x003399);
    ThickDiagonalLine(989,32,989,744,2,0x003399); 
    bar1(45,20,165,60,0x003399);
    puthz(50,25,"景点话题", 24, 24, 0xFFFFFF);
    bar1(45,60,190,90,0x008B8B);
    puthz(50,65,"最热景点推荐",24,24,0xffffff);
    bar1(45,90,230,135,0x7CFC00);
    puthz(50,95,"黄鹤楼",32,32,0xffffff);
    bar1(45,230,230,275,0x7CFC00);
    puthz(45,230,"华中科技大学",32,32,0xffffff);
    bar1(45,375,230,420,0x7CFC00);
    puthz(50,375,"江汉路",32,32,0xffffff);
    bar1(45,530,230,575,0x7CFC00);
    puthz(50,530,"光谷",32,32,0xffffff);
    ThickDiagonalLine(987,11,1016,43,2,0xE6E6FA);
    ThickDiagonalLine(987,43,1016,11,2,0xE6E6FA);
    bar1(240,90,960,700,0xFFFFFF);
    mouse_on(mouse);
    while(1)
    {
        mouse_show(&mouse);
        if (mouse_press(45,90,230,135) == 2)//黄鹤楼
        {
            bar2(45,90,230,135, 0x00477D);
        }
        else if (mouse_press(45,90,230,135) != 2)
        {
            bar2(45,90,230,135, 0x003399);
        }
        if (mouse_press(45,230,230,275) == 2)//华中科技大学
        {
            bar2(45,230,230,275, 0x00477D);
        }
        else if (mouse_press(45,230,230,275) != 2)
        {
            bar2(45,230,230,275, 0x003399);
        }
        if (mouse_press(45,375,230,420) == 2)//江汉路
        {
            bar2(45,375,230,420, 0x00477D);
        }
        else if (mouse_press(45,375,230,420) != 2)
        {
            bar2(45,375,230,420, 0x003399);
        }
        if (mouse_press(45,530,230,575) == 2)//光谷
        {
            bar2(45,530,230,575, 0x00477D);
        }
        else if (mouse_press(45,530,230,575) != 2)
        {
            bar2(45,530,230,575, 0x003399);
        }
        if (mouse_press(987,11,1016,43) == 2)//退出
        {
            bar2(985,9,1018,45, 0x000000);
        }
        else if (mouse_press(987,11,1016,43) != 2)
        {
            bar2(985,9,1018,45, 0x003399);
        }
        if(mouse_press(45,90,230,135) == 1)//黄鹤楼
        {
            bar1(240,90,960,700,0xFFFFFF);
            Readbmp64k(252,120, "bmp\\huang.bmp");
            puthz(510,120,"黄鹤楼简介", 24, 24, 0x000000);
            puthz(510,150,"黄鹤楼位于武汉市长江南岸的蛇山峰顶，", 24, 24, 0x000000);
            puthz(510,180,"是中国四大名楼之一。", 24, 24, 0x000000);
            puthz(510,210,"黄鹤楼始建于三国时期，历经多次重建，", 24, 24, 0x000000);
            puthz(510,240,"现为国家级旅游景区。", 24, 24, 0x000000);
            puthz(510,270,"黄鹤楼以其独特的建筑风格和悠久的历史", 24, 24, 0x000000);
            puthz(510,300,"吸引了无数游客前来观光。", 24, 24, 0x000000);
            puthz(510,330,"黄鹤楼是武汉的标志性建筑，", 24, 24, 0x000000);
            puthz(510,360,"也是中国文化的重要象征。", 24, 24, 0x000000);
            puthz(510,390,"黄鹤楼的美丽风景和深厚的文化底蕴，", 24, 24, 0x000000);
            puthz(510,420,"让人流连忘返。", 24, 24, 0x000000);
            puthz(510,450,"黄鹤楼是一个充满历史和文化的地方，", 24, 24, 0x000000);
            puthz(510,480,"值得每一个人去探索和发现。", 24, 24, 0x000000);
        }
        else if(mouse_press(45,230,230,275) == 1)//华中科技大学
        {
            bar1(240,90,960,700,0xFFFFFF);
            Readbmp64k(252,120,"bmp\\hua.bmp");
            puthz(510,120,"华中科技大学简介", 24, 24, 0x000000);
            puthz(510,150,"华中科技大学位于武汉市，是教育部直属", 24, 24, 0x000000);
            puthz(510,180,"全国重点大学，国家重点建设高校。", 24, 24, 0x000000);
            puthz(510,210,"学校前身为华中工学院。", 24, 24, 0x000000);
            puthz(510,240,"华中科技大学以工为主，多学科协调发展。", 24, 24, 0x000000);
            puthz(510,270,"学校拥有一流的师资力量和科研条件，", 24, 24, 0x000000);
            puthz(510,300,"培养了大批优秀人才。", 24, 24, 0x000000);
            puthz(510,330,"华中科技大学校园环境优美，", 24, 24, 0x000000);
            puthz(510,360,"学校的图书馆、实验室等都非常完善。", 24, 24, 0x000000);
            puthz(510,390,"华中科技大学是充满活力、创新的地方，", 24, 24, 0x000000);
            puthz(510,420,"吸引了无数学子前来求学。", 24, 24, 0x000000);
            puthz(510,450,"华中科技大学是充满希望和未来的地方，", 24, 24, 0x000000);
            puthz(510,480,"值得每一个人去探索和发现。", 24, 24, 0x000000);
        }
        else if(mouse_press(45,375,230,420) == 1)//江汉路
        {
            bar1(240,90,960,700,0xFFFFFF);
            Readbmp64k(252,120,"bmp\\jiang.bmp");
            puthz(510,120,"江汉路简介", 24, 24, 0x000000);
            puthz(510,150,"江汉路是武汉市的一条著名商业街，", 24, 24, 0x000000);
            puthz(510,180,"是武汉的购物和美食中心。", 24, 24, 0x000000);
            puthz(510,210,"江汉路两侧有许多商场、餐厅、咖啡馆等，", 24, 24, 0x000000);
            puthz(510,240,"吸引了无数游客前来游玩。", 24, 24, 0x000000);
            puthz(510,270,"江汉路的建筑风格独特，", 24, 24, 0x000000);
            puthz(510,300,"融合了中西文化的元素。", 24, 24, 0x000000);
            puthz(510,330,"在这里，你可以品尝到各种美食，", 24, 24, 0x000000);
            puthz(510,360,"体验到武汉的独特文化。", 24, 24, 0x000000);
            puthz(510,390,"江汉路是一个充满活力和魅力的地方，", 24, 24, 0x000000);
            puthz(510,420,"让人流连忘返。", 24, 24, 0x000000);
            puthz(510,450,"江汉路是一个充满乐趣和风情的地方，", 24, 24, 0x000000);
            puthz(510,480,"值得每一个人去探索和发现。", 24, 24, 0x000000);
        }
        else if(mouse_press(45,530,230,575) == 1)//光谷
        {
            bar1(240,90,960,700,0xFFFFFF);
            Readbmp64k(252,120,"bmp\\guang.bmp");
            puthz(510,120,"光谷简介", 24, 24, 0x000000);
            puthz(510,150,"光谷是武汉市的一个高新技术开发区，", 24, 24, 0x000000);
            puthz(510,180,"是中国光电子产业的重要基地。", 24, 24, 0x000000);
            puthz(510,210,"光谷拥有一流的科研机构和企业，", 24, 24, 0x000000);
            puthz(510,240,"吸引了无数科技人才前来工作和生活。", 24, 24, 0x000000);
            puthz(510,270,"光谷的建筑风格现代，", 24, 24, 0x000000);
            puthz(510,300,"融合了科技和艺术的元素。", 24, 24, 0x000000);
            puthz(510,330,"在这里，你可以感受到科技的魅力，", 24, 24, 0x000000);
            puthz(510,360,"体验到未来的生活方式。", 24, 24, 0x000000);
            puthz(510,390,"光谷是一个充满活力和创新的地方，", 24, 24, 0x000000);
            puthz(510,420,"让人充满希望。", 24, 24, 0x000000);
            puthz(510,450,"光谷是一个充满希望和未来的地方，", 24, 24, 0x000000);
            puthz(510,480,"值得每一个人去探索和发现。", 24, 24, 0x000000);
        }
        else if(mouse_press(987,11,1016,43) == 1)//退出
        {
            *page=15;
            break;
        }
    }
}
